[{"id":599,"created_at":"2025-01-14 11:11:21","date":"2025-01-14","text":"Haha but why ? https://www.distributed-systems.net/index.php/books/ds4/ds4-ebook/","photos":[{"path":"599_20250114031121.jpg","width":1280,"height":862,"id":599}],"tags":[],"quoted_message":null,"forwarded_info":null},{"id":598,"created_at":"2025-01-14 07:56:53","date":"2025-01-14","text":"I guess that the heating of my apartment is under some kind of centralized system, the total amount is limited. Because in the day, I always so warm that I turn it off totally, but near the night -- I guess most residents come home, I feel it's not powerful as in the day.","photos":[],"tags":[],"quoted_message":null,"forwarded_info":null},{"id":597,"created_at":"2025-01-14 07:11:20","date":"2025-01-14","text":"https://www.globaltimes.cn/page/202501/1326802.shtml\n\nIn my RED timeline, the posts become half English and half Chinese because of this, which is very funny.","photos":[{"path":"597_20250113231120.jpg","width":1200,"height":720,"id":597}],"tags":[],"quoted_message":null,"forwarded_info":null},{"id":596,"created_at":"2025-01-13 14:42:34","date":"2025-01-13","text":"I renamed my channel's name to \"memo in the garbage time of history\", which perfectly reflects my mind in 2025","photos":[{"path":"596_20250113064234.jpg","width":800,"height":179,"id":596}],"tags":[],"quoted_message":null,"forwarded_info":null},{"id":594,"created_at":"2025-01-01 10:15:28","date":"2025-01-01","text":"On the last day of 2024, I sit in my apartment in Chicago, reflecting on my future and the main goals for the next two years. I've been thinking about key themes like Computer Graphics, Technical Artistry, Digital Media, and Creative Tools. Broadly, I want to pursue a field that blends technology and art to make a meaningful impact on people's daily lives.\n\nI understand that reaching my goals will require a significant commitment of time and energy to mastering math, research, coding, and debugging. But if this is the field I am passionate about dedicating my life to, why not start now? If I don't try, I'll regret and will try it one day eventually. If I try, even if I fail, at least I’ll know I gave it my all.\n\nThis is the perfect age to explore, to discover what truly matters to me. As I’ve decided, for the next two years—and beyond—let’s just do it.","photos":[],"tags":["life"],"quoted_message":null,"forwarded_info":null}]