[{"id":638,"created_at":"2025-02-20 14:23:10","date":"2025-02-20","text":"I started to do one of my class's homework before the last day of DDL, I've forgot most of the key points of it unfortunately. \n\nAnd as a non-video learner, I'm always distracted by other things when I'm trying to learn by video. So, right now, I'm trying to have a quick view on this assignment by reading the transcript of the recorded video. I think I find my way.  LMAO","photos":[{"path":"638_20250220062310.jpg","width":1280,"height":960,"id":638}],"tags":["fun"],"quoted_message":null,"forwarded_info":null},{"id":636,"created_at":"2025-02-20 10:13:21","date":"2025-02-20","text":"以前 我会专门找时间读诗\n有段时间 我也喜欢写点文字\n但那已经是久远记忆\n\n似乎是 —— 一 typing \n是的 —— 现在不是下笔而是 typing\n就总是不满意\n\n不满意那些平均水准的文字\n不满意旧事重提\n干瘪 无情 \n不满意\n\n就是不满意\n我称呼它们为死的文字\n灵动的汉字在我的手下死掉\n真可怜\n\n于是写得愈少\n我的中文词汇库缩减\n多会了几道 leetcode 算法题\n这样的一物换一物是否值得\n\n现在 人工智能批量产出\n它们写得又好又快\n我高兴又失落 怎么证明自己不能被替代\n有限的时间里 我又如何最大化完整我的人格\n\n没有答案\n但是重新拾起一些写字的习惯是好的\n因为我喜欢写字的自己\n喜欢这样强行把段落拆成诗的自己","photos":[],"tags":["writing"],"quoted_message":null,"forwarded_info":null},{"id":634,"created_at":"2025-02-11 08:06:02","date":"2025-02-11","text":"hhh","photos":[{"path":"634_20250211000602.jpg","width":638,"height":630,"id":634}],"tags":[],"quoted_message":null,"forwarded_info":null},{"id":633,"created_at":"2025-02-05 12:11:38","date":"2025-02-05","text":"https://www.youtube.com/shorts/VCoExF_Xaqo\n\nxswl, totally same\n\n>I'm now realizing I haven't even scratched the surface of what Balatro is as a game.","photos":[{"path":"633_20250205041138.jpg","width":405,"height":720,"id":633}],"tags":[],"quoted_message":null,"forwarded_info":null},{"id":632,"created_at":"2025-02-04 11:40:05","date":"2025-02-04","text":"https://cosx.org/2011/08/meaning-of-traveling/\n\n写算法题作业头疼摸鱼摸到了这篇文章 ... 好像重返高中时期看那些热血逆袭小说","photos":[],"tags":[],"quoted_message":null,"forwarded_info":null},{"id":631,"created_at":"2025-02-03 12:22:12","date":"2025-02-03","text":"写下这段文字的我好狠毒啊 hhh\n\nWhat is a \"男宝妈\". During my trip home for the Mid-Autumn Festival, I was forced to learn about my good-for-nothing brother's recent situation. I asked why they were still giving him money, enabling his downward spiral, saying that he would only understand when they completely stop supporting him. She said they couldn't give up on him, or he would truly abandon himself, adding that his low self-esteem has already led to depression. She then commented on how smart I am and how fortunate my fate is. She claimed that during her pregnancy with me, she coincidentally ate fish every day, which is why I'm good at studying, but she didn't know this when pregnant with my brother.\n\nHeaven knows I woke up at 6 AM and finished evening self-study at 10 PM in high school, studying under a desk lamp until midnight. Heaven knows how often I've been unhappy about not being smart enough and not developing my potential in childhood. Heaven knows how many times I've cried in endless self-doubt and internal struggle. My emotional breakdowns frequently affected my studies, and for a long time, I wished I had never been born.\n\nIf I seem fine now, it's because before age 21, everything I did was to prove that \"I'm absolutely not inferior to males\" and to spite those who insist on having sons. After 21, I felt I had already won this gender war at the family level, and now I focus more on self-realization and thinking about what I want to spend the rest of my life with. As for my brother, my poor brother, he's like a puddle of mud, spending endless hours watching Douyin videos, without thoughts, and of course —— without future.","photos":[],"tags":[],"quoted_message":null,"forwarded_info":null},{"id":629,"created_at":"2025-02-01 15:53:40","date":"2025-02-01","text":">No matter what you choose, build stuff and be around smart people. “Stuff” can be a lot of different things。\n\nBuilding stuffs——做出东西来。","photos":[],"tags":[],"quoted_message":null,"forwarded_info":null}]